;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! org-noter)
(package! org-journal)
(package! mingus)
(package! org-fancy-priorities)
(package! circadian)
(package! visual-fill-column)
(package! company-quickhelp)
(package! lsp-ui)
(package! lsp-ivy)
(package! telega)
(package! posframe)
(package! ivy-posframe)
(package! company-tabnine)
(package! cnfonts)
(package! org-reveal)
