;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! org-journal)
(package! elpy)
(package! lsp-treemacs)
(package! lsp-ui)
(package! company-lsp)
;;(package! eglot)
(package! company-tabnine)
(package! toml-mode)
(package! py-autopep8)
(package! elfeed)
(package! elfeed-goodies)
(package! elfeed-org)
(package! try)
(package! darkroom)
(package! format-all)
(package! ox-hugo)
(package! org-noter)
(package! circadian)
(package! mingus)
;;(package! emojify)
;;(package! company-emoji)
(package! org-fancy-priorities)
(package! org-preview-html)
(package! elpy)
(package! visual-fill-column)
(package! company-quickhelp)
(package! helm-lsp)
(package! telega)
(package! nyan-mode)
(package! cnfonts)
(package! posframe)
(package! ivy-posframe)
(package! company-box)
